from enum import Enum


class Status(Enum):
    MISSING = 4
    PRESENT = 0
    NOT_PRESENT = 1
    PROBLEMS = 2
    TRUSTED = 10
    NOT_TRUSTED = 20

pupils = {
    "895077813": ["Бугаев Иван", Status.MISSING, Status.TRUSTED],
    "5542778227": ["Романов Павел", Status.MISSING, Status.TRUSTED],
    "1008188677": ["Шарандин Даниил", Status.MISSING, Status.TRUSTED], #???
    "316335103": ["Абрамов Дмитрий", Status.MISSING, Status.TRUSTED], #???
    "7828761093": ["Слейман Юссеф", Status.MISSING, Status.TRUSTED],
    "6184062442": ["Передриенко Артем", Status.MISSING, Status.TRUSTED], #???
    "1359078569": ["Авербух Роман", Status.MISSING, Status.TRUSTED],
    "8077775432": ["Беннани Рами", Status.MISSING, Status.TRUSTED],
    "1048223112": ["Смольская Кристина", Status.MISSING, Status.TRUSTED],
    "1335531460": ["Капитонов Артём", Status.MISSING, Status.TRUSTED],
    "1394526060": ["Бахтияров Бахтиёр", Status.MISSING, Status.TRUSTED],
    "418779655": ["Котлов Макар", Status.MISSING, Status.TRUSTED],
    "155297103": ["Чачина Анна", Status.MISSING, Status.TRUSTED],
    "5033895590": ["Чиняев Артем", Status.MISSING, Status.TRUSTED], #???
    "1287935345": ["Заричный Владимир", Status.MISSING, Status.TRUSTED],
    "1777324274": ["Дмитриев Олег", Status.MISSING, Status.TRUSTED],
    "804935233": ["Карпов Григорий", Status.MISSING, Status.TRUSTED],
    "2119886423": ["Долмацын Марк", Status.MISSING, Status.TRUSTED],
    "1100895375": ["Левицкий Дмитрий", Status.MISSING, Status.TRUSTED], #???
    "1889692325": ["Шахназаров Эмиль", Status.MISSING, Status.TRUSTED],
    "1059138125": ["Шошков Александр", Status.MISSING, Status.TRUSTED], #???
    "2125087440": ["Якушев Михаил", Status.MISSING, Status.TRUSTED],
    "1423054638": ["Юрусов Иван", Status.MISSING, Status.TRUSTED],
    "5837416325": ["Демьянчук Ярослав", Status.MISSING, Status.TRUSTED],
    "7567362093": ["Пустохин Даниил", Status.MISSING, Status.TRUSTED], #???
    "839174691": ["Тян Александр", Status.MISSING, Status.TRUSTED], #???
    "612368276": ["Кубарьков Илья", Status.MISSING, Status.TRUSTED],
}
pupils_by_name = {
    "Бугаев Иван": "895077813",
    "Романов Павел": "5542778227",
    "Шарандин Даниил": "1008188677",
    "Абрамов Дмитрий": "316335103",
    "Слейман Юссеф": "7828761093",
    "Передриенко Артем": "6184062442",
    "Авербух Роман": "1359078569",
    "Беннани Рами": "8077775432",
    "Смольская Кристина": "1048223112",
    "Капитонов Артём": "1335531460",
    "Бахтияров Бахтиёр": "1394526060",
    "Котлов Макар": "418779655",
    "Чачина Анна": "155297103",
    "Чиняев Артем": "5033895590",
    "Заричный Владимир": "1287935345",
    "Дмитриев Олег": "1777324274",
    "Карпов Григорий": "804935233",
    "Долмацын Марк": "2119886423",
    "Левицкий Дмитрий": "1100895375",
    "Шахназаров Эмиль": "1889692325",
    "Шошков Александр": "1059138125",
    "Якушев Михаил": "2125087440",
    "Юрусов Иван": "1423054638",
    "Демьянчук Ярослав": "5837416325",
    "Пустохин Даниил": "7567362093",
    "Тян Александр": "839174691",
    "Кубарьков Илья": "612368276"
}
# 1] Абрамов Дмитрий Васильевич
# 2] Авербух Роман Никитич
# 3] Бахтияров Бахтиёр Бахридинович
# 4] Беннани Рами Ахмед Асил
# 5] Бугаев Иван Владимирович - 895077813
# 6] Демьянчук Ярослав Юрьевич
# 7] Дмитриев Олег Михайлович
# 8] Долмацын Марк Владимирович
# 9] Заричный Владимир Владимирович
# 10] Капитонов Артём Витальевич
# 11] Карпов Григорий Алексеевич
# 12] Котлов Макар Анатольевич
# 13] Кубарьков Илья Викторович
# 14] Левицкий Дмитрий Сергеевич
# 15] Передриенко Артем Денисович
# 16]Пустохин Даниил Дмитриевич
# 17] Романов Павел Алексеевич
# 18] Слейман Мохамад Юссеф
# 19] Смольская Кристина Евгеньевна
# 20] Тян Александр Викторович
# 21] Чачина Анна Сергеевна
# 22] Чиняев Артем Динисович
# 23] Шарандин Данил Максимович
# 24] Шахназаров Эмиль Каренович
# 25] Шошков Александр Николаевич
# 26] Юрусов Иван Алексеевич
# 27] Якушев Михаил Антонович