from enum import Enum


class Status(Enum):
    MISSING = 4
    PRESENT = 0
    NOT_PRESENT = 1
    PROBLEMS = 2

pupils = {
    "895077813": ["Бугаев Иван", Status.MISSING],
    "5542778227": ["Павел Романов", Status.MISSING],
    "1008188677": ["Даниил", Status.MISSING], #???
    "316335103": ["Дмитрий", Status.MISSING], #???
    "7828761093": ["Слейман Юссеф", Status.MISSING],
    "6184062442": ["Артем", Status.MISSING], #???
    "1359078569": ["Авербух Роман", Status.MISSING],
    "8077775432": ["Беннани Рами", Status.MISSING],
    "1048223112": ["Смольская Кристина", Status.MISSING],
    "1335531460": ["Капитонов Артём", Status.MISSING],
    "1394526060": ["Бахтияров Бахтиёр", Status.MISSING],
    "418779655": ["Котлов Макар", Status.MISSING],
    "155297103": ["Чачина Анна", Status.MISSING],
    "5033895590": ["Артем", Status.MISSING], #???
    "1287935345": ["Заричный Владимир", Status.MISSING],
    "1777324274": ["Дмитриев Олег", Status.MISSING],
    "804935233": ["Карпов Григорий", Status.MISSING],
    "2119886423": ["Долмацын Марк", Status.MISSING],
    "1100895375": ["Дмитрий", Status.MISSING], #???
    "1889692325": ["Шахназаров Эмиль", Status.MISSING],
    "1059138125": ["Александр", Status.MISSING], #???
    "2125087440": ["Якушев Михаил", Status.MISSING],
    "1423054638": ["Юрусов Иван", Status.MISSING],
    "5837416325": ["Демьянчук Ярослав", Status.MISSING],
    "7567362093": ["Даниил", Status.MISSING], #???
    "839174691": ["Александр", Status.MISSING], #???
    "612368276": ["Кубарьков Илья", Status.MISSING],
}

# 1] Абрамов Дмитрий Васильевич
# 2] Авербух Роман Никитич
# 3] Бахтияров Бахтиёр Бахридинович
# 4] Беннани Рами Ахмед Асил
# 5] Бугаев Иван Владимирович - 895077813
# 6] Демьянчук Ярослав Юрьевич
# 7] Дмитриев Олег Михайлович
# 8] Долмацын Марк Владимирович
# 9] Заричный Владимир Владимирович
# 10] Капитонов Артём Витальевич
# 11] Карпов Григорий Алексеевич
# 12] Котлов Макар Анатольевич
# 13] Кубарьков Илья Викторович
# 14] Левицкий Дмитрий Сергеевич
# 15] Передриенко Артем Денисович
# 16]Пустохин Даниил Дмитриевич
# 17] Романов Павел Алексеевич
# 18] Слейман Мохамад Юссеф
# 19] Смольская Кристина Евгеньевна
# 20] Тян Александр Викторович
# 21] Чачина Анна Сергеевна
# 22] Чиняев Артем Динисович
# 23] Шарандин Данил Максимович
# 24] Шахназаров Эмиль Каренович
# 25] Шошков Александр Николаевич
# 26] Юрусов Иван Алексеевич
# 27] Якушев Михаил Антонович